tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
brew "python@3.9"
brew "awscli"
brew "azure-cli"
brew "balena-cli"
brew "bash"
brew "bash-completion"
brew "bash-git-prompt"
brew "byobu"
brew "circleci"
brew "fx"
brew "fzf"
brew "gh"
brew "go"
brew "gping"
brew "helm"
brew "helm@2"
brew "hub"
brew "iproute2mac"
brew "jq"
brew "kube-ps1"
brew "kubectx"
brew "postgresql"
brew "stern"
brew "terraform"
brew "vault"
brew "velero"
brew "virtualenv"
cask "docker"
cask "font-hack"
cask "google-cloud-sdk"
cask "keystore-explorer"
cask "sublime-text"
cask "xquartz"
