# Brewfile for Homebrew
# -- this is for my personal system

# Tap some Homebrew kegs
tap "golangci/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "johanhaleby/kubetail"
tap "knative/client"
tap "kreuzwerker/taps"

# Homebrew application installs
brew "ansible"
brew "ansible-lint"
brew "arping"
brew "aws-vault"
brew "awscli"
brew "azure-cli"
brew "bash"
brew "bash-completion"
brew "bash-git-prompt"
brew "byobu"
brew "calicoctl"
brew "circleci"
brew "direnv"
brew "fx"
brew "fzf"
brew "gh"
brew "git"
brew "guile"
brew "go"
brew "gping"
brew "helm"
brew "helm@2"
brew "hub"
brew "irssi"
brew "iproute2mac"
brew "jq"
brew "kube-linter"
brew "kubernetes-cli"
brew "kube-ps1"
brew "kubectx"
brew "kustomize"
brew "libssh"
brew "linkerd"
brew "nmap"
brew "nghttp2"
brew "node"
brew "pango"
brew "perl-build"
brew "postgresql"
brew "python@3.8"
brew "python@3.9"
brew "python3"
brew "stern"
brew "travis"
brew "tree"
brew "unbound"
brew "virtualenv"
brew "watch"

# Homebrew tap specific installs
brew "golangci/tap/golangci-lint"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/terraform-ls"
brew "hashicorp/tap/vault"
brew "johanhaleby/kubetail/kubetail"
brew "knative/client/kn"
brew "kreuzwerker/taps/awsu"

# Homebrew OSX Cask Installations
cask "dbeaver-community"
cask "docker"
cask "font-hack"
cask "gimp"
cask "google-cloud-sdk"
cask "keystore-explorer"
cask "lens"
cask "powershell"
cask "sublime-merge"
cask "sublime-text"
cask "virtualbox"
cask "wireshark"
cask "xquartz"
