tap "dart-lang/dart"
tap "fluxcd/tap"
tap "golangci/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "johanhaleby/kubetail"
tap "knative/client"
tap "kreuzwerker/taps"
tap "sass/sass"
brew "libyaml"
brew "readline"
brew "xz"
brew "ansible"
brew "ansible-lint"
brew "arping"
brew "automake"
brew "aws-vault"
brew "awscli"
brew "azure-cli"
brew "bash"
brew "bash-completion"
brew "bash-git-prompt"
brew "bison"
brew "byobu"
brew "calicoctl"
brew "chruby"
brew "circleci"
brew "direnv"
brew "docker", link: false
brew "docker-credential-helper", link: false
brew "unbound"
brew "harfbuzz"
brew "libssh"
brew "pango"
brew "node"
brew "fx"
brew "fzf"
brew "gdbm"
brew "gh"
brew "ghostscript"
brew "git"
brew "glslviewer"
brew "go"
brew "gobject-introspection"
brew "gping"
brew "guile"
brew "nghttp2"
brew "openssl@1.1"
brew "gulp-cli", link: false
brew "helm"
brew "helm@2"
brew "hexo"
brew "hub"
brew "hugo"
brew "iproute2mac"
brew "irssi"
brew "jq"
brew "k9s"
brew "kube-linter"
brew "kubernetes-cli"
brew "kube-ps1"
brew "kubectx"
brew "kustomize"
brew "libffi"
brew "linkerd"
brew "llm"
brew "nmap"
brew "perl-build"
brew "php"
brew "pidgin"
brew "postgresql@14"
brew "python@3.8"
brew "rbenv"
brew "ruby-install"
brew "sevenzip"
brew "step"
brew "stern"
brew "telnet"
brew "terragrunt"
brew "travis"
brew "tree"
brew "vault"
brew "virtualenv", link: false
brew "virtualenvwrapper"
brew "watch"
brew "fluxcd/tap/flux"
brew "golangci/tap/golangci-lint"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform-ls"
brew "johanhaleby/kubetail/kubetail"
brew "knative/client/kn"
brew "kreuzwerker/taps/awsu"
brew "sass/sass/sass"
cask "1password-cli"
cask "butt"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "docker-toolbox"
cask "font-hack"
cask "freecad"
cask "gimp"
cask "google-cloud-sdk"
cask "keystore-explorer"
cask "kid3"
cask "lens"
cask "mkvtools"
cask "openscad"
cask "powershell"
cask "pronterface"
cask "qbittorrent"
cask "slic3r"
cask "sublime-merge"
cask "sublime-text"
cask "superslicer"
cask "virtualbox"
cask "vlc"
cask "wireshark"
cask "xquartz"
vscode "alefragnani.pascal"
vscode "alefragnani.pascal-formatter"
vscode "bierner.markdown-preview-github-styles"
vscode "budparr.language-hugo-vscode"
vscode "chouzz.vscode-better-align"
vscode "circleci.circleci"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "eamodio.gitlens"
vscode "eliostruyf.vscode-hugo-themer"
vscode "fivethree.vscode-hugo-snippets"
vscode "ginfuru.ginfuru-vscode-jekyll-syntax"
vscode "ginfuru.vscode-jekyll-snippets"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "ionutvmi.path-autocomplete"
vscode "kaellarkin.hugo-shortcode-syntax"
vscode "mhutchie.git-graph"
vscode "ml.nc-gcode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.vscode-serial-monitor"
vscode "mtxr.sqltools"
vscode "oderwat.indent-rainbow"
vscode "platformio.platformio-ide"
vscode "redhat.vscode-yaml"
vscode "saurabh.integrated-stackoverflow"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "twxs.cmake"
vscode "vsciot-vscode.vscode-arduino"
vscode "vscjava.vscode-java-debug"
vscode "vscode-icons-team.vscode-icons"
vscode "wix.vscode-import-cost"
vscode "yzhang.markdown-all-in-one"
